**English:** Import pandas and numpy, then create a DataFrame with several missing values (`np.nan`).
**Hindi:** Pandas aur numpy import karein, fir kai missing values (`np.nan`) ke saath ek DataFrame banayein.

In [1]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Amit', np.nan, 'Ramesh', 'Priya', 'Sanket', 'Anita', 'Rahul'],
    'Age': [23, 29, 35, 22, np.nan, 19, 29],
    'Department': ['Sales','HR','IT','Sales','IT','HR','Sales'],
    'Salary': [35000, 42000, 80000, 30000, 95000, 20000, np.nan],
    'Experience': [np.nan, 4, 10, 1, 15, 0.5, 5],
    'Performance_Score': [70, 88, 92, np.nan, 95, 55, 80]
}
df = pd.DataFrame(data)

**English:** Display the DataFrame to see its initial state.
**Hindi:** DataFrame ko uski shuruaati state dekhne ke liye display karein.

In [2]:
df

     Name   Age Department   Salary  Experience  Performance_Score
0    Amit  23.0      Sales  35000.0         NaN               70.0
1     NaN  29.0         HR  42000.0         4.0               88.0
2  Ramesh  35.0         IT  80000.0        10.0               92.0
3   Priya  22.0      Sales  30000.0         1.0                NaN
4  Sanket   NaN         IT  95000.0        15.0               95.0
5   Anita  19.0         HR  20000.0         0.5               55.0
6   Rahul  29.0      Sales      NaN         5.0               80.0

**English:** Check for the total count of missing values in each column.
**Hindi:** Har column mein missing values ki total sankhya check karein.

In [3]:
df.isna().sum()

Name                 1
Age                  1
Department           0
Salary               1
Experience           1
Performance_Score    1
dtype: int64

**English:** Manually fill the missing 'Name' at index 1 with 'Neha'.
**Hindi:** Index 1 par missing 'Name' ko 'Neha' se manually fill karein.

In [4]:
df.loc[1,'Name'] = 'Neha'

**English:** Fill the remaining missing values using the mean for numeric columns.
**Hindi:** Bachi hui missing values ko numeric columns ke liye mean ka istemal karke bharein.

In [11]:
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df['Experience'].fillna(df['Experience'].mean(),inplace = True)
df['Performance_Score'].fillna(df['Performance_Score'].mean(),inplace = True)
df['Age'].fillna(df['Age'].mean(),inplace = True)

/tmp/ipykernel_1662/1181435884.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)
/tmp/ipykernel_1662/1181435884.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Experience'].fillna(df['Experience'].mean(),inplace = True)
/tmp/ipykernel_1662/1181435884.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Performance_Score'].fillna(df['Performance_Score'].mean(),inplace = True)
/tmp/ipykernel_1662/1181435884.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace = True)

**English:** Convert the data types of several columns to integer for cleaner data.
**Hindi:** Saaf data ke liye kai columns ke data types ko integer mein convert karein.

In [6]:
df['Experience'] = df['Experience'].astype(int)
df['Salary'] = df['Salary'].astype(int)
df['Age'] = df['Age'].astype(int)
df['Performance_Score'] = df['Performance_Score'].astype(int)

**English:** Verify that all missing values have been filled.
**Hindi:** Verify karein ki sabhi missing values bhar di gayi hain.

In [7]:
df.isna().sum()

Name                 0
Age                  0
Department           0
Salary               0
Experience           0
Performance_Score    0
dtype: int64

**English:** Display the cleaned DataFrame.
**Hindi:** Cleaned DataFrame ko display karein.

In [8]:
df

     Name  Age Department  Salary  Experience  Performance_Score
0    Amit   23      Sales   35000           5                 70
1    Neha   29         HR   42000           4                 88
2  Ramesh   35         IT   80000          10                 92
3   Priya   22      Sales   30000           1                 80
4  Sanket   26         IT   95000          15                 95
5   Anita   19         HR   20000           0                 55
6   Rahul   29      Sales   50333           5                 80

**English:** Group by 'Department' and 'Name' and perform multiple aggregations. Then, filter to show only the 'HR' department and sort by average salary.
**Hindi:** 'Department' aur 'Name' se group karein aur multiple aggregations perform karein. Fir, sirf 'HR' department dikhane ke liye filter karein aur average salary se sort karein.

In [9]:
df.groupby(['Department','Name']).agg(
    avg_salary =('Salary','mean'),
    max_salary =('Salary','max'),
    min_salary =('Salary','min')
).round().query('Department == "HR"').sort_values(by='avg_salary',ascending=True)

                  avg_salary  max_salary  min_salary
Department Name
HR         Anita     20000.0       20000       20000
           Neha      42000.0       42000       42000

**English:** Filter the DataFrame for employees older than 25, with more than 5 years of experience, and a performance score greater than 80.
**Hindi:** 25 se zyada umar, 5 saal se zyada experience, aur 80 se zyada performance score wale employees ke liye DataFrame filter karein.

In [ ]:
df[(df['Age'] > 25) & (df['Experience'] > 5)& (df['Performance_Score']> 80)]

     Name  Age Department  Salary  Experience  Performance_Score
2  Ramesh   35         IT   80000          10                 92
4  Sanket   26         IT   95000          15                 95

Bad pipe message: %s [b' 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Sa']
Bad pipe message: %s [b'ri/537.36\r\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/', b'ng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7\r\nAccept-Encoding: gzip, deflate, br, zstd\r\nA']
Bad pipe message: %s [b'ept-Language: en-US,en;q=0.9,hi;q=0.8,mr;q=0.7\r\nPriority: u=0, i\r\nReferer: https://studio.firebase', b'oogle.com/\r\nSec-Ch-Ua: "Chromium";v="142", "G', b'gle Chrome";v="142", "Not_A Brand";v="99"\r\nSec-Ch-Ua-Arch: "x86"\r\nSec-Ch-Ua-Bitness: "64"\r\nSec-Ch-Ua-Form-Fact', b's: "Desktop"\r\nSec-Ch-Ua-Full-Version: "142.0.7444.60"\r\nSec-Ch-Ua-Full-Version-List: "Chromium";v="142.0.7444.6']
Bad pipe message: %s [b', "Google Chrome";v="142.0.7444.60", "Not_A Bra']
Bad pipe message: %s [b'";v="99.0.0.0"\r\nSec-Ch-Ua-Mobile: ?0\r\nSec-Ch-Ua-Model: ""\r\nSec-Ch-Ua-Platform: "Windows"\r\nSec-Ch-Ua-Platform-']
Bad pipe message: %s [b'rsion: "19.0.0"\r\nSec-Ch-Ua-Wow64: ?0\r\nSec-Fetch-Dest: iframe\r\nSec-Fetch-Mode: navigat', b'\nSec-Fetch-Site: cross-site\r\nSec-Fetch-Storage-Access: active\r\nSec-Fetch-User: ?1\r\nSec-User-Ip: 106.', b'5.178.30\r\nUpgrade-Insecure-Requests: 1\r\nX-Forward', b'-Host: 39429-firebase-dsml-ghost-1758779015506.cluster-ancjwrkgr5dvux4qug5rbzyc2y.cloudworkstations.']
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list
ERROR:tornado.general:Uncaught exception in ZMQStream callback
Traceback (most recent call last):
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/zmq/eventloop/zmqstream.py", line 565, in _log_error
    f.result()
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 302, in dispatch_control
    await self.process_control(msg)
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/ipykernel/kernelbase.py", line 308, in process_control
    idents, msg = self.session.feed_identities(msg, copy=False)
                  ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/home/user/dsml-ghost/.venv/lib/python3.11/site-packages/jupyter_client/session.py", line 994, in feed_identities
    raise ValueError(msg)
ValueError: DELIM not in msg_list